_posts/2015-03-14-A-helm-mu4e-contact-selector.html
---
title: A helm-mu4e contact selector
date: 2015/03/14 10:21:09
updated: 2015/03/14 10:21:09
categories: emacs,email,helm
tags: 
---


<p>
I have been using <a href="http://www.djcbsoftware.nl/code/mu/mu4e.html">mu4e</a> in Emacs for email for about three months now. It is pretty good, and I hardly ever use the gmail web interface any more. The email completion in mu4e is ok, but I am frequently surprised at what it does not find, and totally spoiled by how good Gmail is at this. The built in completion seems to get lost if you don't start the search with the first few letters. Not always, but too often for me. I don't always remember the first letters, and want to search by name, or company. I would love to search by tags in org-contacts. This should be simple in helm, where you can build up candidates with different bits of information. Here I explore a helm interface, which I think might be better than the built in mu4e support, and even be better than gmail.
</p>

<p>
In my dream email completer, I want some easy way to define my own groups, I want to use org-contacts (and its tags), and I want every email address in the mails I have in my archive as completion candidates.  helm supports multiple sources, so I initially tried a separate source for each of these. Preliminary efforts suggested it is not possible to mark multiple selections from different sources and pass them all to one function. So, we combine all email candidates into one list of (searchable-string . email-address) cons cells. To get an idea of how many contacts we are looking at:
</p>

<p>
Here is what I have in my org-contacts file:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(length (org-contacts-db))
</pre>
</div>

<pre class="example">
173
</pre>

<p>
And here is what mu4e knows about. Interestingly, it takes a while for this variable to get populated because the request is asynchronous. After the first time though it sticks around. I think just opening mu4e will populate this variable.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(length mu4e~contacts-for-completion)
</pre>
</div>

<pre class="example">
12717
</pre>

<p>
So, I have close to 13,000 potential email addresses to choose from. For my email groups, I will just use a list of cons cells like (group-name . "comma-separated emails"). Then, I will loop through the org-contacts-db and the mu4e completion list to make the helm candidates. Finally, we add some functions to open our org-contact, and to tag org-contacts so it is easier to make groups.
</p>

<p>
Here is the code I have been using.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here we set aliases for groups.</span>
(setq email-groups
      '((<span style="color: #008000;">"ms"</span> . <span style="color: #008000;">"email1, email2"</span>)
        (<span style="color: #008000;">"phd"</span> . <span style="color: #008000;">"email3, email4"</span>)))


(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-contacts-open-from-email</span> (email)
  <span style="color: #036A07;">"Open org-contact with matching EMAIL. If no match, create new</span>
<span style="color: #036A07;">entry with prompts for first and last name."</span>
  (<span style="color: #0000FF;">let</span> ((contact (<span style="color: #0000FF;">catch</span> '<span style="color: #D0372D;">contact</span>
                   (loop for contact in  (org-contacts-db)
                         do
                         (<span style="color: #0000FF;">when</span> (string= email (cdr (assoc <span style="color: #008000;">"EMAIL"</span> (elt contact 2))))
                           (<span style="color: #0000FF;">throw</span> '<span style="color: #D0372D;">contact</span> contact))))))

    (<span style="color: #0000FF;">unless</span> contact
                (set-buffer (find-file-noselect (ido-completing-read
                                                 <span style="color: #008000;">"Select org-contact file: "</span>
                                                 org-contacts-files)))
                (goto-char (point-max))
                (insert (format  <span style="color: #008000;">"\n* %s %s\n"</span>
                                 (read-input <span style="color: #008000;">"First name: "</span>)
                                 (read-input <span style="color: #008000;">"Last name: "</span>)))
                (org-entry-put (point) <span style="color: #008000;">"EMAIL"</span> email)
                (save-buffer))

    (<span style="color: #0000FF;">when</span> contact
      (find-file  (cdr (assoc <span style="color: #008000;">"FILE"</span> (elt contact 2))))
      (goto-char (elt contact 1))
      (show-subtree))))


(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-contacts-tag-selection</span> (selection)
  <span style="color: #036A07;">"Prompts you for a tag, and tags each entry in org-contacts</span>
<span style="color: #036A07;">that has a matching email in `</span><span style="color: #D0372D;">helm-marked-candidates</span><span style="color: #036A07;">'. Ignore</span>
<span style="color: #036A07;">emails that are not in an org-contact file. I am not sure what</span>
<span style="color: #036A07;">the best thing to do there is. Probably prompt for a file, and</span>
<span style="color: #036A07;">add an entry to the end of it."</span>
  (<span style="color: #0000FF;">save-excursion</span>
    (<span style="color: #0000FF;">let</span> ((tag (read-input <span style="color: #008000;">"Tag: "</span>)))
      (loop for email in (helm-marked-candidates)
            do
            (<span style="color: #0000FF;">let</span> ((contact (<span style="color: #0000FF;">catch</span> '<span style="color: #D0372D;">contact</span>
                             (loop for contact in  (org-contacts-db)
                                   do
                                   (<span style="color: #0000FF;">when</span> (string=
                                          email
                                          (cdr (assoc
                                                <span style="color: #008000;">"EMAIL"</span>
                                                (elt contact 2))))
                                     (<span style="color: #0000FF;">throw</span> '<span style="color: #D0372D;">contact</span> contact))))))
              <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">add new contact and tag it</span>
              (<span style="color: #0000FF;">unless</span> contact
                (set-buffer (find-file-noselect (ido-completing-read
                                                 <span style="color: #008000;">"Select org-contact file: "</span>
                                                 org-contacts-files)))
                (goto-char (point-max))
                (insert (format  <span style="color: #008000;">"\n* %s %s\n"</span>
                                 (read-input <span style="color: #008000;">"First name: "</span>)
                                 (read-input <span style="color: #008000;">"Last name: "</span>)))
                (org-entry-put (point) <span style="color: #008000;">"EMAIL"</span> email)
                (org-set-tags-to (list tag))
                (save-buffer))
              <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">update tags on existing entry</span>
              (<span style="color: #0000FF;">when</span> contact
                (find-file-noselect  (cdr (assoc <span style="color: #008000;">"FILE"</span> (elt contact 2))))
                (set-buffer (marker-buffer (elt contact 1)))
                (goto-char (elt contact 1))
                (org-set-tags-to (append (org-get-tags) (list tag)))))))))


(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">j-insert-emails</span> ()
  <span style="color: #036A07;">"Helm interface to email addresses"</span>
  (interactive)

  (helm <span style="color: #006FE0;">:sources</span> `(((name . <span style="color: #008000;">"Email address candidates"</span>)
                   (candidates . ,(append
                                   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">my aliases</span>
                                   email-groups
                                   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">org-contacts</span>
                                   (loop for contact in (org-contacts-db)
                                         collect
                                         (cons (format
                                                <span style="color: #008000;">"%s %s %s &lt;%s&gt; org-contact"</span>
                                                (cdr (assoc <span style="color: #008000;">"FIRSTNAME"</span> (elt contact 2)))
                                                (cdr (assoc <span style="color: #008000;">"LASTNAME"</span> (elt contact 2)))
                                                (cdr (assoc <span style="color: #008000;">"TAGS"</span> (elt contact 2)))
                                                (cdr (assoc <span style="color: #008000;">"EMAIL"</span> (elt contact 2))))
                                               (cdr (assoc <span style="color: #008000;">"EMAIL"</span> (elt contact 2)))))
                                   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">mu contacts</span>
                                   (loop for contact in mu4e~contacts-for-completion
                                         collect (cons contact contact))))
                   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">only action is to insert string at point.</span>
                   (action . ((<span style="color: #008000;">"insert"</span> . (<span style="color: #0000FF;">lambda</span> (x)
                                            (insert
                                             (mapconcat
                                              'identity
                                              (helm-marked-candidates)
                                              <span style="color: #008000;">","</span>))))
                              (<span style="color: #008000;">"open"</span> . org-contacts-open-from-email)
                              (<span style="color: #008000;">"tag"</span>  . org-contacts-tag-selection)))))))

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Finally, let us bind this to something probably convenient. I use c-c ] for</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">citations. Lets try that in compose mode.</span>
(define-key mu4e-compose-mode-map <span style="color: #008000;">"\C-c]"</span> 'j-insert-emails)
</pre>
</div>
<pre class="example">
j-insert-emails
</pre>

<p>
Now, I have a sweet helm interface with nearly 13,000 email candidates (there is a decent amount of duplication in this list, and some garbage emails from spam, but helm is so fast, this does not bother me). I can pretty quickly narrow to any tagged set of emails from org-contacts with a search that looks like :phd: for example, or [^phd]:group: to get org-contacts tagged group, but not phd. I can narrow the selection on first name, lastname, parts of email addresses, tags in org-contacts, etc&#x2026; I can open a contact, or tag contacts, even add new contacts to org-contacts. I have been using this for a few weeks, and so far I like it. Occasionally I find mu4e~contacts-for-completion is empty, and then I only get my org-contacts emails, but that seems to only happen when I first open emacs. Since Emacs is usually open for days at a time, this has not been an issue very often.
</p>
<p>Copyright (C) 2015 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2015/03/14/A-helm-mu4e-contact-selector.org">org-mode source</a><p><p>Org-mode version = 8.2.10</p>